Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# language-server-install.confirm-step
source: Confirm Step
es_419: Confirmar paso
fr_fr: Confirmer l'étape
zh_cn: 确认步骤

# language-server-install.cancel-button-alert
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# language-server-install.continue-button-alert
source: Continue
es_419: Continuar
fr_fr: Continuer
zh_cn: 继续

# language-server-install.cancel-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# language-server-install.install-button
source: Install
es_419: Instalar
fr_fr: Installer
zh_cn: 安装

# language-server-install.cancel-running-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# language-server-install.continue-button
source: Continue
es_419: Continuar
fr_fr: Continuer
zh_cn: 继续

# language-server-install.installing-package
source: Installing Package
es_419: Instalando paquete
fr_fr: Installation du paquet
zh_cn: 正在安装包

# language-server-install.homepage
source: Homepage
es_419: Página principal
fr_fr: Page d'accueil
zh_cn: 主页

# language-server-install.error-occurred
source: Error Occurred
es_419: Ocurrió un error
fr_fr: Une erreur s'est produite
zh_cn: 发生错误

# language-server-install.step
source: Step
es_419: Paso
fr_fr: Étape
zh_cn: 步骤

# language-server-install.successfully-installed
source: Successfully Installed
es_419: Se instaló correctamente
fr_fr: Installé avec succès
zh_cn: 安装成功

# language-server-install.error-occurred-status
source: Error Occurred
es_419: Ocurrió un error
fr_fr: Une erreur s'est produite
zh_cn: 发生错误

# language-server-install.install-method
source: Install Method
es_419: Método de instalación
fr_fr: Méthode d'installation
zh_cn: 安装方法

# language-server-install.package
source: Package
es_419: Paquete
fr_fr: Paquet
zh_cn: 包

# language-server-install.unknown
source: Unknown
es_419: Desconocido
fr_fr: Inconnu
zh_cn: 未知

# language-server-install.installer
source: Installer
es_419: Instalador
fr_fr: Installateur
zh_cn: 安装器

# file-inspector.identity-and-type
source: Identity and Type
es_419: Identidad y tipo
fr_fr: Identité et type
zh_cn: 标识与类型

# file-inspector.text-settings
source: Text Settings
es_419: Configuración de texto
fr_fr: Réglages du texte
zh_cn: 文本设置

# file-inspector.name
source: Name
es_419: Nombre
fr_fr: Nom
zh_cn: 名称

# file-inspector.dismiss
source: Dismiss
es_419: Descartar
fr_fr: Fermer
zh_cn: 关闭

# file-inspector.default-detected
source: Default - Detected
es_419: Predeterminado - Detectado
fr_fr: Par défaut - Détecté
zh_cn: 默认 - 自动检测

# file-inspector.location
source: Location
es_419: Ubicación
fr_fr: Emplacement
zh_cn: 位置

# file-inspector.choose
source: Choose...
es_419: Elegir...
fr_fr: Choisir...
zh_cn: 选择…

# file-inspector.dismiss-location
source: Dismiss
es_419: Descartar
fr_fr: Fermer
zh_cn: 关闭

# file-inspector.indent-using
source: Indent using
es_419: Indentar usando
fr_fr: Indenter avec
zh_cn: 缩进使用

# file-inspector.spaces
source: Spaces
es_419: Espacios
fr_fr: Espaces
zh_cn: 空格

# file-inspector.tabs
source: Tabs
es_419: Pestañas
fr_fr: Tabulations
zh_cn: 制表符

# file-inspector.widths
source: Widths
es_419: Anchos
fr_fr: Largeurs
zh_cn: 宽度

# file-inspector.tab
source: Tab
fr_fr: Onglet
zh_cn: 制表符

# file-inspector.tab-width-help
source: The visual width of tab characters
es_419: El ancho visual de los caracteres de tabulación
fr_fr: La largeur visuelle des caractères de tabulation
zh_cn: 制表符的显示宽度

# file-inspector.indent
source: Indent
es_419: Sangría
fr_fr: Indentation
zh_cn: 缩进

# file-inspector.indent-width-help
source: The number of spaces to insert when the tab key is pressed.
es_419: La cantidad de espacios a insertar cuando se presiona la tecla tab.
fr_fr: Le nombre d'espaces à insérer lorsque la touche tabulation est pressée.
zh_cn: 按下 Tab 键时插入的空格数。

# file-inspector.wrap-lines
source: Wrap lines
es_419: Ajustar líneas
fr_fr: Retour à la ligne
zh_cn: 自动换行

# file-inspector.save-file
source: Save File
es_419: Guardar archivo
fr_fr: Enregistrer le fichier
zh_cn: 保存文件

# general-settings.appearance
source: Appearance
es_419: Apariencia
fr_fr: Apparence
zh_cn: 外观

# general-settings.appearance-system
source: System
es_419: Sistema
fr_fr: Système
zh_cn: 系统

# general-settings.show-issues
source: Show Issues
es_419: Mostrar problemas
fr_fr: Afficher les problèmes
zh_cn: 显示问题

# general-settings.show-issues-inline
source: Show Inline
es_419: Mostrar en línea
fr_fr: Afficher en ligne
zh_cn: 内联显示

# general-settings.show-live-issues
source: Show Live Issues
es_419: Mostrar problemas en vivo
fr_fr: Afficher les problèmes en direct
zh_cn: 显示实时问题

# general-settings.file-extensions
source: File Extensions
es_419: Extensiones de archivo
fr_fr: Extensions de fichier
zh_cn: 文件扩展名

# general-settings.file-extensions-show-all
source: Show all
es_419: Mostrar todo
fr_fr: Tout afficher
zh_cn: 显示全部

# general-settings.file-extensions-show-only
source: Show only
es_419: Mostrar solo
fr_fr: Afficher uniquement
zh_cn: 仅显示

# general-settings.file-extensions-hide-only
source: Hide only
es_419: Ocultar solamente
fr_fr: Masquer uniquement
zh_cn: 仅隐藏

# general-settings.file-icon-style
source: File Icon Style
es_419: Estilo de ícono de archivo
fr_fr: Style d'icône de fichier
zh_cn: 文件图标样式

# general-settings.navigator-tab-bar-position
source: Navigator Tab Bar Position
es_419: Posición de la barra de pestañas del navegador
fr_fr: Position de la barre d'onglets du navigateur
zh_cn: 导航器标签栏位置

# general-settings.navigator-tab-bar-position-side
source: Side
es_419: Lateral
fr_fr: Côté
zh_cn: 侧边

# general-settings.inspector-tab-bar-position
source: Inspector Tab Bar Position
es_419: Posición de la barra de pestañas del Inspector
fr_fr: Position de la barre d'onglets de l'inspecteur
zh_cn: 检查器标签栏位置

# general-settings.reopen-behavior
source: Reopen Behavior
es_419: Comportamiento al reabrir
fr_fr: Comportement de réouverture
zh_cn: 重新打开行为

# general-settings.reopen-behavior-welcome
source: Welcome Screen
es_419: Pantalla de Bienvenida
fr_fr: Écran de bienvenue
zh_cn: 欢迎屏幕

# general-settings.reopen-behavior-open-panel
source: Open Panel
es_419: Abrir panel
fr_fr: Ouvrir un panneau
zh_cn: 打开面板

# general-settings.reopen-behavior-new-document
source: New Document
es_419: Documento nuevo
fr_fr: Nouveau document
zh_cn: 新建文档

# general-settings.after-last-window-closed
source: After the last window is closed
es_419: Después de cerrar la última ventana
fr_fr: Après la fermeture de la dernière fenêtre
zh_cn: 当最后一个窗口关闭后

# general-settings.after-last-window-do-nothing
source: Do nothing
es_419: No hacer nada
fr_fr: Ne rien faire
zh_cn: 不执行任何操作

# general-settings.after-last-window-show-welcome
source: Show Welcome Window
es_419: Mostrar ventana de bienvenida
fr_fr: Afficher la fenêtre de bienvenue
zh_cn: 显示欢迎窗口

# general-settings.after-last-window-quit
source: Quit
es_419: Salir
fr_fr: Quitter
zh_cn: 退出

# general-settings.project-navigator-size
source: Project Navigator Size
es_419: Tamaño del navegador de proyectos
fr_fr: Taille du navigateur de projet
zh_cn: 项目导航器大小

# general-settings.project-navigator-size-small
source: Small
es_419: Pequeño
fr_fr: Petit
zh_cn: 小

# general-settings.project-navigator-size-medium
source: Medium
es_419: Mediano
fr_fr: Moyen
zh_cn: 中

# general-settings.project-navigator-size-large
source: Large
es_419: Grande
fr_fr: Grande
zh_cn: 大

# general-settings.find-navigator-detail
source: Find Navigator Detail
es_419: Detalle del Navegador de Búsqueda
fr_fr: Détail du navigateur de recherche
zh_cn: 查找导航器详情

# general-settings.issue-navigator-detail
source: Issue Navigator Detail
es_419: Detalle del navegador de problemas
fr_fr: Détail du navigateur de problèmes
zh_cn: 问题导航器详情

# general-settings.dialog-warnings
source: Dialog Warnings
es_419: Advertencias de diálogos
fr_fr: Avertissements de dialogue
zh_cn: 对话框警告

# general-settings.reset-dont-ask-warnings
source: Reset \
es_419: Restablecer \
fr_fr: Réinitialiser \
zh_cn: 重置\"不再询问\"警告

# general-settings.codeedit-shell-command
source: 'codeedit' Shell command
es_419: Comando de Shell 'codeedit'
fr_fr: Commande shell 'codeedit'
zh_cn: 'codeedit' Shell 命令

# general-settings.install-shell-command
source: Install
es_419: Instalar
fr_fr: Installer
zh_cn: 安装

# general-settings.check-now
source: Check Now
es_419: Buscar ahora
fr_fr: Vérifier maintenant
zh_cn: 立即检查

# general-settings.check-for-updates
source: Check for updates
es_419: Buscar actualizaciones
fr_fr: Rechercher les mises à jour
zh_cn: 检查更新

# general-settings.last-checked
source: Last checked: %@
es_419: Última verificación: %@
fr_fr: Dernière vérification : %@
zh_cn: 上次检查时间：%@

# general-settings.auto-check-updates
source: Automatically check for app updates
es_419: Buscar actualizaciones de la app automáticamente
fr_fr: Rechercher automatiquement les mises à jour de l'app
zh_cn: 自动检查应用更新

# general-settings.include-prerelease
source: Include pre-release versions
es_419: Incluir versiones preliminares
fr_fr: Inclure les versions préliminaires
zh_cn: 包含预发布版本

# general-settings.auto-save
source: Automatically save changes to disk
es_419: Guardar cambios en disco automáticamente
fr_fr: Enregistrer automatiquement les modifications sur le disque
zh_cn: 自动将更改保存到磁盘

# general-settings.never-checked
source: Never
es_419: Nunca
fr_fr: Jamais
zh_cn: 从不

# general-settings.show-open-with-codeedit
source: Show "Open With CodeEdit" option in Finder
es_419: Mostrar opción \"Abrir con CodeEdit\" en Finder
fr_fr: Afficher l'option « Ouvrir avec CodeEdit » dans le Finder
zh_cn: 在 Finder 中显示\"用 CodeEdit 打开\"选项

# general-settings.auto-reveal-in-navigator
source: Automatically reveal in project navigator
es_419: Mostrar automáticamente en el navegador de proyectos
fr_fr: Révéler automatiquement dans le navigateur de projet
zh_cn: 自动在项目导航器中显示

# project-navigator-menu.show-in-finder
source: Show in Finder
es_419: Mostrar en Finder
fr_fr: Afficher dans le Finder
zh_cn: 在 Finder 中显示

# project-navigator-menu.open-in-tab
source: Open in Tab
es_419: Abrir en pestaña
fr_fr: Ouvrir dans un onglet
zh_cn: 在标签页中打开

# project-navigator-menu.open-in-new-window
source: Open in New Window
es_419: Abrir en ventana nueva
fr_fr: Ouvrir dans une nouvelle fenêtre
zh_cn: 在新窗口中打开

# project-navigator-menu.open-with-external-editor
source: Open with External Editor
es_419: Abrir con editor externo
fr_fr: Ouvrir avec un éditeur externe
zh_cn: 使用外部编辑器打开

# project-navigator-menu.open-as
source: Open As
es_419: Abrir como
fr_fr: Ouvrir comme
zh_cn: 打开方式

# project-navigator-menu.copy-path
source: Copy Path
es_419: Copiar ruta
fr_fr: Copier le chemin
zh_cn: 复制路径

# project-navigator-menu.copy-relative-path
source: Copy Relative Path
es_419: Copiar ruta relativa
fr_fr: Copier le chemin relatif
zh_cn: 复制相对路径

# project-navigator-menu.show-file-inspector
source: Show File Inspector
es_419: Mostrar Inspector de archivos
fr_fr: Afficher l'inspecteur de fichier
zh_cn: 显示文件检查器

# project-navigator-menu.new-file
source: New File...
es_419: Archivo nuevo...
fr_fr: Nouveau fichier...
zh_cn: 新建文件...

# project-navigator-menu.new-file-from-clipboard
source: New File from Clipboard
es_419: Archivo nuevo desde el portapapeles
fr_fr: Nouveau fichier depuis le presse-papiers
zh_cn: 从剪贴板新建文件

# project-navigator-menu.new-folder
source: New Folder
es_419: Carpeta nueva
fr_fr: Nouveau dossier
zh_cn: 新建文件夹

# project-navigator-menu.rename
source: Rename
es_419: Renombrar
fr_fr: Renommer
zh_cn: 重命名

# project-navigator-menu.move-to-trash
source: Move to Trash
es_419: Mover a la papelera
fr_fr: Placer dans la corbeille
zh_cn: 移到废纸篓

# project-navigator-menu.delete-immediately
source: Delete Immediately...
es_419: Eliminar inmediatamente...
fr_fr: Supprimer immédiatement...
zh_cn: 立即删除...

# project-navigator-menu.duplicate-item
source: Duplicate %@
es_419: Duplicar %@
fr_fr: Dupliquer %@
zh_cn: 复制 %@

# project-navigator-menu.folder
source: Folder
es_419: Carpeta
fr_fr: Dossier
zh_cn: 文件夹

# project-navigator-menu.file
source: File
es_419: Archivo
fr_fr: Fichier
zh_cn: 文件

# project-navigator-menu.sort-by-name
source: Sort by Name
es_419: Ordenar por nombre
fr_fr: Trier par nom
zh_cn: 按名称排序

# project-navigator-menu.sort-by-type
source: Sort by Type
es_419: Ordenar por tipo
fr_fr: Trier par type
zh_cn: 按类型排序

# project-navigator-menu.source-control
source: Source Control
es_419: Control de versiones
fr_fr: Contrôle de version
zh_cn: 版本控制

# project-navigator-menu.new-folder-from-selection
source: New Folder from Selection
es_419: Carpeta nueva desde la selección
fr_fr: Nouveau dossier depuis la sélection
zh_cn: 从所选项新建文件夹

# project-navigator-menu.asset-catalog-document
source: Asset Catalog Document
es_419: Documento de catálogo de recursos
fr_fr: Document catalogue de ressources
zh_cn: 资产目录文档

# project-navigator-menu.interface-builder-xib-document
source: Interface Builder XIB Document
es_419: Documento XIB de Interface Builder
fr_fr: Document XIB Interface Builder
zh_cn: Interface Builder XIB 文档

# project-navigator-menu.xcode-project
source: Xcode Project
es_419: Proyecto de Xcode
fr_fr: Projet Xcode
zh_cn: Xcode 项目

# project-navigator-menu.commit-file
source: Commit "%@"...
fr_fr: Committer \"%@\"...
zh_cn: 提交\"%@\"...

# project-navigator-menu.discard-changes
source: Discard Changes...
es_419: Descartar cambios...
fr_fr: Abandonner les modifications...
zh_cn: 丢弃更改...

# project-navigator-menu.add-selected-files
source: Add Selected Files
es_419: Agregar archivos seleccionados
fr_fr: Ajouter les fichiers sélectionnés
zh_cn: 添加所选文件

# project-navigator-menu.mark-selected-files-resolved
source: Mark Selected Files as Resolved
es_419: Marcar archivos seleccionados como resueltos
fr_fr: Marquer les fichiers sélectionnés comme résolus
zh_cn: 将所选文件标记为已解决

# project-navigator-menu.none
source: <None>
es_419: Ninguno
fr_fr: Aucun
zh_cn: 无

# project-navigator-menu.source-code
source: Source Code
es_419: Código fuente
fr_fr: Code source
zh_cn: 源代码

# project-navigator-menu.property-list
source: Property List
es_419: Lista de Propiedades
fr_fr: Liste de propriétés
zh_cn: 属性列表

# project-navigator-menu.ascii-property-list
source: ASCII Property List
es_419: Lista de propiedades ASCII
fr_fr: Liste de propriétés ASCII
zh_cn: ASCII 属性列表

# project-navigator-menu.hex
source: Hex
es_419: Hexadecimal
fr_fr: Hexa
zh_cn: 十六进制

# project-navigator-menu.quick-look
source: Quick Look
es_419: Vistazo rápido
fr_fr: Coup d'œil
zh_cn: 快速查看

# theme-settings.name
source: Name
es_419: Nombre
fr_fr: Nom
zh_cn: 名称

# theme-settings.author
source: Author
es_419: Autor
fr_fr: Auteur
zh_cn: 作者

# theme-settings.light
source: Light
es_419: Clara
fr_fr: Clair
zh_cn: 浅色

# theme-settings.dark
source: Dark
es_419: Oscuro
fr_fr: Sombre
zh_cn: 深色

# theme-settings.text-section
source: Text
es_419: Texto
fr_fr: Texte
zh_cn: 文本

# theme-settings.text-color
source: Text
es_419: Texto
fr_fr: Texte
zh_cn: 文本

# theme-settings.cursor
source: Cursor
fr_fr: Curseur
zh_cn: 光标

# theme-settings.background-section
source: Background
es_419: Fondo
fr_fr: Arrière-plan
zh_cn: 背景

# theme-settings.background-color
source: Background
es_419: Fondo
fr_fr: Arrière-plan
zh_cn: 背景

# theme-settings.current-line
source: Current Line
es_419: Línea actual
fr_fr: Ligne actuelle
zh_cn: 当前行

# theme-settings.selection
source: Selection
es_419: Selección
fr_fr: Sélection
zh_cn: 选中

# theme-settings.keywords
source: Keywords
es_419: Palabras clave
fr_fr: Mots-clés
zh_cn: 关键字

# theme-settings.commands
source: Commands
es_419: Comandos
fr_fr: Commandes
zh_cn: 命令

# theme-settings.attributes
source: Attributes
es_419: Atributos
fr_fr: Attributs
zh_cn: 属性

# theme-settings.values
source: Values
es_419: Valores
fr_fr: Valeurs
zh_cn: 值

# theme-settings.numbers
source: Numbers
es_419: Números
fr_fr: Nombres
zh_cn: 数字

# theme-settings.strings
source: Strings
es_419: Cadenas
fr_fr: Chaînes
zh_cn: 字符串

# theme-settings.characters
source: Characters
es_419: Caracteres
fr_fr: Caractères
zh_cn: 字符

# theme-settings.comments
source: Comments
es_419: Comentarios
fr_fr: Commentaires
zh_cn: 注释

# theme-settings.duplicate-to-edit-message
source: Duplicate this theme to make changes.
es_419: Duplica este tema para realizar cambios.
fr_fr: Dupliquez ce thème pour effectuer des modifications.
zh_cn: 复制此主题以进行更改。

# theme-settings.bundled-themes-help
source: Bundled themes must be duplicated to make changes.
es_419: Los temas incluidos deben duplicarse para realizar cambios.
fr_fr: Les thèmes intégrés doivent être dupliqués pour pouvoir être modifiés.
zh_cn: 内置主题必须先复制才能修改。

# theme-settings.duplicate-to-edit-warning
source: Warning: Duplicate this theme to make changes.
es_419: Advertencia: Duplica este tema para realizar cambios.
fr_fr: Avertissement : Dupliquez ce thème pour effectuer des modifications.
zh_cn: 警告:复制此主题以进行更改。

# theme-settings.delete-button
source: Delete...
es_419: Eliminar...
fr_fr: Supprimer...
zh_cn: 删除...

# theme-settings.duplicate-button-ellipsis
source: Duplicate...
es_419: Duplicar...
fr_fr: Dupliquer...
zh_cn: 复制…

# theme-settings.duplicate-button
source: Duplicate
es_419: Duplicar
fr_fr: Dupliquer
zh_cn: 复制

# theme-settings.cancel-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# theme-settings.done-button
source: Done
es_419: Listo
fr_fr: Terminé
zh_cn: 完成

# theme-settings.delete-confirmation
source: Are you sure you want to delete the theme "%@"?
es_419: ¿Estás seguro de que quieres eliminar el tema \"%@\"?
fr_fr: Voulez-vous vraiment supprimer le thème « %@ » ?
zh_cn: 确定要删除主题\"%@\"吗?

# theme-settings.delete-theme-button
source: Delete Theme
es_419: Eliminar tema
fr_fr: Supprimer le thème
zh_cn: 删除主题

# theme-settings.cancel-delete-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# theme-settings.cannot-undo-message
source: This action cannot be undone.
es_419: Esta acción no se puede deshacer.
fr_fr: Cette action est irréversible.
zh_cn: 此操作无法撤销。

# text-editing-settings.autocomplete-braces-description
source: Automatically insert closing braces ("}")
es_419: Insertar automáticamente llaves de cierre (\"}\")
fr_fr: Insérer automatiquement les accolades fermantes (\"}\")
zh_cn: 自动插入闭合大括号（\"}\"）

# text-editing-settings.use-system-cursor
source: Use System Cursor
es_419: Usar cursor del sistema
fr_fr: Utiliser le curseur système
zh_cn: 使用系统光标

# text-editing-settings.overscroll-none
source: None
es_419: Ninguno
fr_fr: Aucun
zh_cn: 无

# text-editing-settings.overscroll-small
source: Small
es_419: Pequeño
fr_fr: Petit
zh_cn: 小

# text-editing-settings.overscroll-medium
source: Medium
es_419: Mediano
fr_fr: Moyen
zh_cn: 中

# text-editing-settings.overscroll-large
source: Large
es_419: Grande
fr_fr: Grande
zh_cn: 大

# text-editing-settings.indent-tabs
source: Tabs
es_419: Pestañas
fr_fr: Tabulations
zh_cn: 制表符

# text-editing-settings.indent-spaces
source: Spaces
es_419: Espacios
fr_fr: Espaces
zh_cn: 空格

# text-editing-settings.indent-width
source: Indent Width
es_419: Ancho de sangría
fr_fr: Largeur d'indentation
zh_cn: 缩进宽度

# text-editing-settings.spaces-unit
source: spaces
es_419: espacios
fr_fr: espaces
zh_cn: 空格

# text-editing-settings.indent-width-help
source: The number of spaces to insert when the tab key is pressed.
es_419: La cantidad de espacios a insertar cuando se presiona la tecla tab.
fr_fr: Le nombre d'espaces à insérer lorsque la touche tabulation est pressée.
zh_cn: 按下 Tab 键时插入的空格数。

# text-editing-settings.tab-width-spaces-unit
source: spaces
es_419: espacios
fr_fr: espaces
zh_cn: 空格

# text-editing-settings.tab-width-help
source: The visual width of tabs.
es_419: El ancho visual de las tabulaciones.
fr_fr: La largeur visuelle des tabulations.
zh_cn: 制表符的显示宽度。

# text-editing-settings.bracket-highlight-disabled
source: Disabled
es_419: Desactivado
fr_fr: Désactivé
zh_cn: 已停用

# text-editing-settings.bracket-highlight-bordered
source: Bordered
es_419: Con borde
fr_fr: Avec bordure
zh_cn: 带边框

# text-editing-settings.bracket-highlight-flash
source: Flash
es_419: Destello
fr_fr: Clignotement
zh_cn: 闪烁

# text-editing-settings.bracket-highlight-underline
source: Underline
es_419: Subrayado
fr_fr: Souligner
zh_cn: 下划线

# text-editing-settings.use-custom-color
source: Use Custom Color
es_419: Usar Color Personalizado
fr_fr: Utiliser une couleur personnalisée
zh_cn: 使用自定义颜色

# text-editing-settings.bracket-highlight-color
source: Bracket Pair Highlight Color
es_419: Color de resaltado de pares de corchetes
fr_fr: Couleur de surbrillance des paires de crochets
zh_cn: 括号对高亮颜色

# text-editing-settings.show-gutter-help
source: The gutter displays line numbers and code folding regions.
es_419: El margen muestra números de línea y regiones de plegado de código.
fr_fr: La gouttière affiche les numéros de ligne et les régions de pliage de code.
zh_cn: 边栏显示行号和代码折叠区域。

# text-editing-settings.show-minimap-help
source: The minimap gives you a high-level summary of your source code, with controls to quickly navigate your document.
es_419: El minimapa te proporciona un resumen de alto nivel de tu código fuente, con controles para navegar rápidamente tu documento.
fr_fr: La minimap fournit un aperçu de haut niveau de votre code source, avec des contrôles pour naviguer rapidement dans votre document.
zh_cn: 迷你地图提供源代码的高层次概览，并提供控件以快速浏览文档。

# text-editing-settings.show-code-folding-ribbon
source: Show Code Folding Ribbon
es_419: Mostrar cinta de plegado de código
fr_fr: Afficher le ruban de pliage de code
zh_cn: 显示代码折叠功能区

# text-editing-settings.show-folding-ribbon-help
source: The code folding ribbon lets you fold regions of code. When the gutter is disabled, the folding ribbon is disabled.
es_419: La cinta de plegado de código te permite plegar regiones de código. Cuando el margen está desactivado, la cinta de plegado está desactivada.
fr_fr: Le ruban de pliage de code permet de plier des régions de code. Lorsque la gouttière est désactivée, le ruban de pliage est désactivé.
zh_cn: 代码折叠功能区让您可以折叠代码区域。当边栏被停用时，折叠功能区也会被停用。

# text-editing-settings.show-reformatting-guide-help
source: Shows a vertical guide at the reformat column.
es_419: Muestra una guía vertical en la columna de reformateo.
fr_fr: Affiche un guide vertical à la colonne de reformatage.
zh_cn: 在重新格式化列位置显示一条垂直参考线。

# text-editing-settings.reformat-at-column-help
source: The column at which text should be reformatted.
es_419: La columna en la que el texto debe reformatearse.
fr_fr: La colonne à laquelle le texte doit être reformaté.
zh_cn: 文本应重新格式化的列位置。

# text-editing-settings.show-invisible-characters
source: Show Invisible Characters
es_419: Mostrar caracteres invisibles
fr_fr: Afficher les caractères invisibles
zh_cn: 显示不可见字符

# text-editing-settings.configure-invisible-characters
source: Configure...
es_419: Configurar...
fr_fr: Configurer...
zh_cn: 配置...

# text-editing-settings.show-warning-characters
source: Show Warning Characters
es_419: Mostrar caracteres de advertencia
fr_fr: Afficher les caractères d'avertissement
zh_cn: 显示警告字符

# text-editing-settings.configure-warning-characters
source: Configure...
es_419: Configurar...
fr_fr: Configurer...
zh_cn: 配置...

source: Feedback submitted
es_419: Comentarios enviados
fr_fr: Retour envoyé
zh_cn: 反馈已提交

# feedback.failed-to-submit
source: Failed to submit feedback
es_419: No se pudo enviar la retroalimentación
fr_fr: Échec de l'envoi du commentaire
zh_cn: 提交反馈失败

# feedback.submit-button
source: Submit
es_419: Enviar
fr_fr: Envoyer
zh_cn: 提交

# feedback.no-github-account-title
source: No GitHub Account
es_419: No hay cuenta de GitHub
fr_fr: Aucun compte GitHub
zh_cn: 无 GitHub 账户

# feedback.no-github-account-message
source: A GitHub account is required to submit feedback.
es_419: Se requiere una cuenta de GitHub para enviar comentarios.
fr_fr: Un compte GitHub est requis pour soumettre un retour.
zh_cn: 提交反馈需要 GitHub 账户。

# feedback.cancel-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消
